; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v4 - type_3 ?v7 - type_2)
 	      (pred_1 ?v2 - object ?v7 - type_2)
	      (pred_3 ?v4 - type_3 ?v3 - type_1)
	      (pred_2 ?v4 - type_3 ?v2 - object ?v3 - type_1))

   (:action op_3
       :parameters  (?v4 - type_3 ?v6 ?v5 - type_2)
       :precondition (and  (pred_4 ?v4 ?v6))
       :effect (and  (pred_4 ?v4 ?v5)
		     (not (pred_4 ?v4 ?v6))))

   (:action op_2
       :parameters (?v4 - type_3 ?v1 - object ?v8 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_1 ?v1 ?v8) (pred_4 ?v4 ?v8) (pred_3 ?v4 ?v3))
       :effect (and (pred_2 ?v4 ?v1 ?v3)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_3 ?v4 ?v3))))

   (:action op_1
       :parameters (?v4 - type_3 ?v1 - object ?v8 - type_2 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v1 ?v3) (pred_4 ?v4 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_3 ?v4 ?v3)
		    (not (pred_2 ?v4 ?v1 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_06 obj_04 - type_1
obj_01 obj_02 obj_10 obj_05 - type_2
obj_03 obj_09 obj_08 - object)
(:init
(pred_4 obj_07 obj_02)
(pred_3 obj_07 obj_06)
(pred_3 obj_07 obj_04)
(pred_1 obj_03 obj_02)
(pred_1 obj_09 obj_10)
(pred_1 obj_08 obj_01)
)
(:goal
(and
(pred_1 obj_03 obj_05)
(pred_1 obj_09 obj_05)
(pred_1 obj_08 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_07 ?b obj_04))))
)
)

; plan
1. (op_2 obj_07 obj_03 obj_02 obj_06)
   deleted: (pred_1 obj_03 obj_02) (pred_3 obj_07 obj_06)
   added: (pred_2 obj_07 obj_03 obj_06)
   goals met: 1 of 3
2. (op_3 obj_07 obj_02 obj_05)
   deleted: (pred_4 obj_07 obj_02)
   added: (pred_4 obj_07 obj_05)
   goals met: 1 of 3
3. (op_1 obj_07 obj_03 obj_05 obj_06)
   deleted: (pred_2 obj_07 obj_03 obj_06)
   added: (pred_1 obj_03 obj_05) (pred_3 obj_07 obj_06)
   goals met: 2 of 3
4. (op_3 obj_07 obj_05 obj_10)
   deleted: (pred_4 obj_07 obj_05)
   added: (pred_4 obj_07 obj_10)
   goals met: 2 of 3
5. (op_2 obj_07 obj_09 obj_10 obj_06)
   deleted: (pred_1 obj_09 obj_10) (pred_3 obj_07 obj_06)
   added: (pred_2 obj_07 obj_09 obj_06)
   goals met: 2 of 3
6. (op_3 obj_07 obj_10 obj_05)
   deleted: (pred_4 obj_07 obj_10)
   added: (pred_4 obj_07 obj_05)
   goals met: 2 of 3
7. (op_1 obj_07 obj_09 obj_05 obj_06)
   deleted: (pred_2 obj_07 obj_09 obj_06)
   added: (pred_1 obj_09 obj_05) (pred_3 obj_07 obj_06)
   goals met: 3 of 3
